; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v4 - type_1 ?v6 - type_2)
 	      (pred_4 ?v2 - object ?v6 - type_2)
	      (pred_3 ?v4 - type_1 ?v8 - type_3)
	      (pred_1 ?v4 - type_1 ?v2 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v4 - type_1 ?v5 ?v3 - type_2)
       :precondition (and  (pred_2 ?v4 ?v5))
       :effect (and  (pred_2 ?v4 ?v3)
		     (not (pred_2 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_1 ?v7 - object ?v1 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v1) (pred_2 ?v4 ?v1) (pred_3 ?v4 ?v8))
       :effect (and (pred_1 ?v4 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v1)) 
		    (not (pred_3 ?v4 ?v8))))

   (:action op_1
       :parameters (?v4 - type_1 ?v7 - object ?v1 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v8) (pred_2 ?v4 ?v1))
       :effect (and (pred_4 ?v7 ?v1)
		    (pred_3 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v7 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_06 - type_1
obj_13 obj_05 obj_04 obj_12 - type_3
obj_14 obj_10 obj_11 obj_02 - type_2
obj_09 obj_08 obj_01 obj_07 - object)
(:init
(pred_2 obj_03 obj_11)
(pred_3 obj_03 obj_13)
(pred_3 obj_03 obj_05)
(pred_2 obj_06 obj_02)
(pred_3 obj_06 obj_04)
(pred_3 obj_06 obj_12)
(pred_4 obj_09 obj_11)
(pred_4 obj_08 obj_10)
(pred_4 obj_01 obj_11)
(pred_4 obj_07 obj_02)
)
(:goal
(and
(pred_4 obj_09 obj_02)
(pred_4 obj_08 obj_02)
(pred_4 obj_01 obj_11)
(pred_4 obj_07 obj_02)
)
)

(:constraints
  (always (not (pred_2 obj_03 obj_02)))
)
)

; plan
1. (op_2 obj_03 obj_09 obj_11 obj_05)
   deleted: (pred_4 obj_09 obj_11) (pred_3 obj_03 obj_05)
   added: (pred_1 obj_03 obj_09 obj_05)
   goals met: 2 of 4
2. (op_3 obj_06 obj_02 obj_10)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_10)
   goals met: 2 of 4
3. (op_3 obj_03 obj_11 obj_10)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_10)
   goals met: 2 of 4
4. (op_2 obj_03 obj_08 obj_10 obj_13)
   deleted: (pred_4 obj_08 obj_10) (pred_3 obj_03 obj_13)
   added: (pred_1 obj_03 obj_08 obj_13)
   goals met: 2 of 4
5. (op_1 obj_03 obj_09 obj_10 obj_05)
   deleted: (pred_1 obj_03 obj_09 obj_05)
   added: (pred_4 obj_09 obj_10) (pred_3 obj_03 obj_05)
   goals met: 2 of 4
6. (op_2 obj_06 obj_09 obj_10 obj_12)
   deleted: (pred_4 obj_09 obj_10) (pred_3 obj_06 obj_12)
   added: (pred_1 obj_06 obj_09 obj_12)
   goals met: 2 of 4
7. (op_1 obj_03 obj_08 obj_10 obj_13)
   deleted: (pred_1 obj_03 obj_08 obj_13)
   added: (pred_4 obj_08 obj_10) (pred_3 obj_03 obj_13)
   goals met: 2 of 4
8. (op_3 obj_06 obj_10 obj_02)
   deleted: (pred_2 obj_06 obj_10)
   added: (pred_2 obj_06 obj_02)
   goals met: 2 of 4
9. (op_1 obj_06 obj_09 obj_02 obj_12)
   deleted: (pred_1 obj_06 obj_09 obj_12)
   added: (pred_4 obj_09 obj_02) (pred_3 obj_06 obj_12)
   goals met: 3 of 4
10. (op_3 obj_06 obj_02 obj_10)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_10)
   goals met: 3 of 4
11. (op_2 obj_06 obj_08 obj_10 obj_12)
   deleted: (pred_4 obj_08 obj_10) (pred_3 obj_06 obj_12)
   added: (pred_1 obj_06 obj_08 obj_12)
   goals met: 3 of 4
12. (op_3 obj_06 obj_10 obj_02)
   deleted: (pred_2 obj_06 obj_10)
   added: (pred_2 obj_06 obj_02)
   goals met: 3 of 4
13. (op_1 obj_06 obj_08 obj_02 obj_12)
   deleted: (pred_1 obj_06 obj_08 obj_12)
   added: (pred_4 obj_08 obj_02) (pred_3 obj_06 obj_12)
   goals met: 4 of 4
